In [ ]:
series is just like a column in a table,

In [8]:
import  pandas as pd

In [9]:
df = pd.read_csv('raw_data.csv')

In [49]:
df.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

# --------Indexes change --------

In [ ]:
pd.DataFrame(df, index= l), you donâ€™t need to convert into list, 2D

pd.Series(list(s), index=l)  , 1D
s is likely an iterable (e.g., a set, tuple, or string).so in series , 
series is set tuple , so we need to  convert into list

In [17]:
type(df)

pandas.core.frame.DataFrame

In [27]:
# its changes only first 3 index 

index = pd.DataFrame(df,index=['a', 'b','c'])
index

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
a,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
b,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
c,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
s = df['Name']
s.iloc[1:5]

1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [11]:
#chunk data , means a small data
s= df['Name'][0:10]
s

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [12]:
# default index / named index , whate ever as we want

l =['a','b','c','d' ,'e', 'f' ,'g','h','i', 'j']

In [13]:
s1= pd.Series(list(s),index=l)
s1
#--s1= pd.Series(s,index=l)

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [14]:
# but s1 always remenbers default index

s

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [15]:
s[0]

'Braund, Mr. Owen Harris'

In [16]:
s1['a'] #[0] also can use

'Braund, Mr. Owen Harris'

# --------- append / concatenate ---------

In [24]:
#s2=s1.append(s)

s2 = pd.concat([s1, pd.Series(s)]) 
s2

a                              Braund, Mr. Owen Harris
b    Cumings, Mrs. John Bradley (Florence Briggs Th...
c                               Heikkinen, Miss. Laina
d         Futrelle, Mrs. Jacques Heath (Lily May Peel)
e                             Allen, Mr. William Henry
f                                     Moran, Mr. James
g                              McCarthy, Mr. Timothy J
h                       Palsson, Master. Gosta Leonard
i    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
j                  Nasser, Mrs. Nicholas (Adele Achem)
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
5                                     Moran, Mr. James
6                              McCarthy, Mr. Timothy J
7                       Palsson, Master. Gosta Leonard
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
dtype: object

In [26]:
s2['f'] # check which index it takes named or default

'Moran, Mr. James'

In [44]:
s4=pd.Series([3,4,5,6,6], index=[2,4,5,3,1])
s4

2    3
4    4
5    5
3    6
1    6
dtype: int64

In [45]:
df_s4 = s4.to_frame('number') # Convert Series to DataFrame
df_s4

   number
2       3
4       4
5       5
3       6
1       6

In [59]:
s5 =pd.Series([31,42,54,62,63], index=[6,4,9,7,2])
s5

6    31
4    42
9    54
7    62
2    63
dtype: int64

In [91]:
s6=pd.concat([s4,s5])
s6

2     3
4     4
5     5
3     6
1     6
6    31
4    42
9    54
7    62
2    63
dtype: int64

In [83]:
s6[2] # its named index

2     3
2    63
dtype: int64

In [81]:
s6[0:6] #only in slicing it takes defult index

2     3
4     4
5     5
3     6
1     6
6    31
dtype: int64

In [64]:
s4

2    3
4    4
5    5
3    6
1    6
dtype: int64

In [65]:
s5

6    31
4    42
9    54
7    62
2    63
dtype: int64

In [97]:
# The multiplication is performed based on matching index values. If an index exists in both s4 and s5, their corresponding values are multiplied. If an index is present in only one of the series, the result is NaN.

s7=s4*s5 #NaN represents missing or undefined data. "Not a Number"
s7.to_frame('s4*s5')

   s4*s5
1    NaN
2  189.0
3    NaN
4  168.0
5    NaN
6    NaN
7    NaN
9    NaN

In [68]:
type(s7)

pandas.core.series.Series

In [98]:
s4+s5

1     NaN
2    66.0
3     NaN
4    46.0
5     NaN
6     NaN
7     NaN
9     NaN
dtype: float64